In [2]:
import pandas as pd

In [3]:
data=pd.read_csv("C:/Users/Manikanta/Machine learning/CSV Files/titanic.csv")

In [4]:
data.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [5]:
# conditional probability
# p(A/B)=Probability of event A knowing that event B has already occured
# example: pick a random card, you know it is a diamond. Now what is the probability of that card being a queen
# here he asking p(queen/diamond)
# we already no of diamonds. so it is refers to B
# we want to find probability of queen. so it refers to A
# p(A/B) = p(queen/diamond) = 1/13

In [6]:
# bayes theorem
# p(A/B)=(p(B/A)*p(A))/p(B)

In [8]:
data=data.drop(columns=["PassengerId","Name","SibSp","Parch","Ticket","Cabin","Embarked"])

In [9]:
data.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [10]:
target=data.Survived
inputs=data.drop("Survived",axis=1)

In [11]:
dummies=pd.get_dummies(inputs,columns=["Sex"],prefix_sep="@")

In [12]:
dummies.head()

   Pclass   Age     Fare  Sex@female  Sex@male
0       3  22.0   7.2500           0         1
1       1  38.0  71.2833           1         0
2       3  26.0   7.9250           1         0
3       1  35.0  53.1000           1         0
4       3  35.0   8.0500           0         1

In [13]:
dummies.isnull().sum()

Pclass          0
Age           177
Fare            0
Sex@female      0
Sex@male        0
dtype: int64

In [14]:
dummies.isna()

     Pclass    Age   Fare  Sex@female  Sex@male
0     False  False  False       False     False
1     False  False  False       False     False
2     False  False  False       False     False
3     False  False  False       False     False
4     False  False  False       False     False
..      ...    ...    ...         ...       ...
886   False  False  False       False     False
887   False  False  False       False     False
888   False   True  False       False     False
889   False  False  False       False     False
890   False  False  False       False     False

[891 rows x 5 columns]

In [17]:
dummies.isna().any()

Pclass        False
Age            True
Fare          False
Sex@female    False
Sex@male      False
dtype: bool

In [18]:
dummies.columns[dummies.isna().any()]

Index(['Age'], dtype='object')

In [19]:
dummies.Age=dummies.Age.fillna(dummies.Age.mean())

In [20]:
dummies.isnull().sum()

Pclass        0
Age           0
Fare          0
Sex@female    0
Sex@male      0
dtype: int64

In [21]:
from sklearn.model_selection import train_test_split

In [22]:
X_train, X_test, y_train, y_test = train_test_split(dummies, target, test_size=0.2, random_state=42)

In [23]:
len(X_train)

712

In [24]:
len(X_test)

179

In [25]:
from sklearn.naive_bayes import GaussianNB

In [26]:
gnb=GaussianNB()

In [27]:
gnb.fit(X_train,y_train)

GaussianNB()

In [29]:
y_pred=gnb.predict(X_test)

In [30]:
from sklearn.metrics import accuracy_score

In [31]:
accuracy_score(y_pred,y_test)

0.776536312849162

In [32]:
gnb.score(X_test,y_test)

0.776536312849162